echo "
     ╔═╦═╦═╗╔╦═╦═╦══╗╔══╦══╦══╗
     ║╬║╬║║║║║╦╣╔╩╗╔╝║╔╗╠╗╔╣══╣
     ║╔╣╗╣║╠╣║╩╣╚╗║║─║╔╗║║║╠══║
     ╚╝╚╩╩═╩═╩═╩═╝╚╝─╚══╝╚╝╚══╝"
echo "     🆁🅰🅸🅽🅱🅾🆆  🅱🆄🆃🆃🅴🆁🅵🅻🆈  🅶🅼🅰🅸🅽🅶"
echo "  ∴══• Cᴏᴘʏʀɪɢʜᴛ Rᴇsᴇʀᴠᴇᴅ Bʏ •══∴\n    ≪─━ BTS×BSC [𝟤𝟢𝟣𝟫-𝟤𝟢𝟤𝟢] ━─≫"
echo "   ---------------------------------
      🆁🅰🅸🅽🅱🅾🆆 🅱🆄🆃🆃🅴🆁🅵🅻🆈 🅶🅼🅰🅸🅽🅶
        • Dec & Remoded BY •
          『 Aʙɪʀ Vɪʀᴜs 』
   ---------------------------------"
echo "ᴏʀɪɢɪɴᴀʟ ғɪʟᴇ ᴍᴀᴅᴇ ʙʏ  @ɪᵗˢ481ʀ & @xᶜᵒᵈᵉᴀⁿⁱᵏ"
echo "    Tʜɪs Fɪʟᴇ Oɴʟʏ Fᴏʀ RBG VɪP Mᴇᴍʙᴇʀs "
echo ""
cd /data/data/com.pubg.krmobile && rm -rf app_crashrecord files && echo > files && echo > app_crashrecord
sleep 3
echo "
     ╔═╦═╦═╗╔╦═╦═╦══╗╔══╦══╦══╗
     ║╬║╬║║║║║╦╣╔╩╗╔╝║╔╗╠╗╔╣══╣
     ║╔╣╗╣║╠╣║╩╣╚╗║║─║╔╗║║║╠══║
     ╚╝╚╩╩═╩═╩═╩═╝╚╝─╚══╝╚╝╚══╝"
echo "     🆁🅰🅸🅽🅱🅾🆆  🅱🆄🆃🆃🅴🆁🅵🅻🆈  🅶🅼🅰🅸🅽🅶"
echo "  ∴══• Cᴏᴘʏʀɪɢʜᴛ Rᴇsᴇʀᴠᴇᴅ Bʏ •══∴\n    ≪─━ BTS×BSC [𝟤𝟢𝟣𝟫-𝟤𝟢𝟤𝟢] ━─≫"
echo "   ---------------------------------
      🆁🅰🅸🅽🅱🅾🆆 🅱🆄🆃🆃🅴🆁🅵🅻🆈 🅶🅼🅰🅸🅽🅶
        • Dec & Remoded BY •
          『 Aʙɪʀ Vɪʀᴜs 』
   ---------------------------------"
echo "ᴏʀɪɢɪɴᴀʟ ғɪʟᴇ ᴍᴀᴅᴇ ʙʏ  @ɪᵗˢ481ʀ & @xᶜᵒᵈᵉᴀⁿⁱᵏ"
echo "    Tʜɪs Fɪʟᴇ Oɴʟʏ Fᴏʀ RBG VɪP Mᴇᴍʙᴇʀs "
echo ""
am start -n com.pubg.krmobile/com.epicgames.ue4.SplashActivity
iptables -I INPUT -s dlied1.qq.com -j DROP &>/dev/null
iptables -I INPUT -s www.qq.com -j DROP &>/dev/null
iptables -I INPUT -s www.baidu.com -j DROP &>/dev/null
iptables -I INPUT -s .qq.com -j DROP &>/dev/null
echo "
     ╔═╦═╦═╗╔╦═╦═╦══╗╔══╦══╦══╗
     ║╬║╬║║║║║╦╣╔╩╗╔╝║╔╗╠╗╔╣══╣
     ║╔╣╗╣║╠╣║╩╣╚╗║║─║╔╗║║║╠══║
     ╚╝╚╩╩═╩═╩═╩═╝╚╝─╚══╝╚╝╚══╝"
echo "     🆁🅰🅸🅽🅱🅾🆆  🅱🆄🆃🆃🅴🆁🅵🅻🆈  🅶🅼🅰🅸🅽🅶"
echo "  ∴══• Cᴏᴘʏʀɪɢʜᴛ Rᴇsᴇʀᴠᴇᴅ Bʏ •══∴\n    ≪─━ BTS×BSC [𝟤𝟢𝟣𝟫-𝟤𝟢𝟤𝟢] ━─≫"
echo "   ---------------------------------
      🆁🅰🅸🅽🅱🅾🆆 🅱🆄🆃🆃🅴🆁🅵🅻🆈 🅶🅼🅰🅸🅽🅶
        • Dec & Remoded BY •
          『 Aʙɪʀ Vɪʀᴜs 』
   ---------------------------------"
echo "ᴏʀɪɢɪɴᴀʟ ғɪʟᴇ ᴍᴀᴅᴇ ʙʏ  @ɪᵗˢ481ʀ & @xᶜᵒᵈᵉᴀⁿⁱᵏ"
echo "    Tʜɪs Fɪʟᴇ Oɴʟʏ Fᴏʀ RBG VɪP Mᴇᴍʙᴇʀs "
echo ""
sleep 4
cp -r /storage/emulated/0/BSC_Automation_v4/Mod/Korean/Android /storage/emulated/0
cp -r /storage/emulated/0/BSC_Automation_v4/Mod/Korean/Android /storage/emulated/0
echo "
     ╔═╦═╦═╗╔╦═╦═╦══╗╔══╦══╦══╗
     ║╬║╬║║║║║╦╣╔╩╗╔╝║╔╗╠╗╔╣══╣
     ║╔╣╗╣║╠╣║╩╣╚╗║║─║╔╗║║║╠══║
     ╚╝╚╩╩═╩═╩═╩═╝╚╝─╚══╝╚╝╚══╝"
echo "     🆁🅰🅸🅽🅱🅾🆆  🅱🆄🆃🆃🅴🆁🅵🅻🆈  🅶🅼🅰🅸🅽🅶"
echo "  ∴══• Cᴏᴘʏʀɪɢʜᴛ Rᴇsᴇʀᴠᴇᴅ Bʏ •══∴\n    ≪─━ BTS×BSC [𝟤𝟢𝟣𝟫-𝟤𝟢𝟤𝟢] ━─≫"
echo "   ---------------------------------
      🆁🅰🅸🅽🅱🅾🆆 🅱🆄🆃🆃🅴🆁🅵🅻🆈 🅶🅼🅰🅸🅽🅶
        • Dec & Remoded BY •
          『 Aʙɪʀ Vɪʀᴜs 』
   ---------------------------------"
echo "ᴏʀɪɢɪɴᴀʟ ғɪʟᴇ ᴍᴀᴅᴇ ʙʏ  @ɪᵗˢ481ʀ & @xᶜᵒᵈᵉᴀⁿⁱᵏ"
echo "    Tʜɪs Fɪʟᴇ Oɴʟʏ Fᴏʀ RBG VɪP Mᴇᴍʙᴇʀs "
echo ""
cp -r /storage/emulated/0/BSC_Automation_v4/Mod/Korean/Android /storage/emulated/0
cp -r /storage/emulated/0/BSC_Automation_v4/Mod/Korean/Android /storage/emulated/0
mv /data/data/com.pubg.krmobile/lib/liblbs.so /storage/emulated/0/BSC_Automation_v4/Ori
mv /data/data/com.pubg.krmobile/lib/libtersafe.so /storage/emulated/0/BSC_Automation_v4/Ori
mv /data/data/com.pubg.krmobile/lib/libtprt.so /storage/emulated/0/BSC_Automation_v4/Ori
mv /data/data/com.pubg.krmobile/lib/libUE4.so /storage/emulated/0/BSC_Automation_v4/Ori
echo "
     ╔═╦═╦═╗╔╦═╦═╦══╗╔══╦══╦══╗
     ║╬║╬║║║║║╦╣╔╩╗╔╝║╔╗╠╗╔╣══╣
     ║╔╣╗╣║╠╣║╩╣╚╗║║─║╔╗║║║╠══║
     ╚╝╚╩╩═╩═╩═╩═╝╚╝─╚══╝╚╝╚══╝"
echo "     🆁🅰🅸🅽🅱🅾🆆  🅱🆄🆃🆃🅴🆁🅵🅻🆈  🅶🅼🅰🅸🅽🅶"
echo "  ∴══• Cᴏᴘʏʀɪɢʜᴛ Rᴇsᴇʀᴠᴇᴅ Bʏ •══∴\n    ≪─━ BTS×BSC [𝟤𝟢𝟣𝟫-𝟤𝟢𝟤𝟢] ━─≫"
echo "   ---------------------------------
      🆁🅰🅸🅽🅱🅾🆆 🅱🆄🆃🆃🅴🆁🅵🅻🆈 🅶🅼🅰🅸🅽🅶
        • Dec & Remoded BY •
          『 Aʙɪʀ Vɪʀᴜs 』
   ---------------------------------"
echo "ᴏʀɪɢɪɴᴀʟ ғɪʟᴇ ᴍᴀᴅᴇ ʙʏ  @ɪᵗˢ481ʀ & @xᶜᵒᵈᵉᴀⁿⁱᵏ"
echo "    Tʜɪs Fɪʟᴇ Oɴʟʏ Fᴏʀ RBG VɪP Mᴇᴍʙᴇʀs "
echo ""
mv /storage/emulated/0/BSC_Automation_v4/Mod/liblbs.so /data/data/com.pubg.krmobile/lib
mv /storage/emulated/0/BSC_Automation_v4/Mod/libtersafe.so /data/data/com.pubg.krmobile/lib
mv /storage/emulated/0/BSC_Automation_v4/Mod/libtprt.so /data/data/com.pubg.krmobile/lib
mv /storage/emulated/0/BSC_Automation_v4/Mod/libUE4.so /data/data/com.pubg.krmobile/lib
echo "
     ╔═╦═╦═╗╔╦═╦═╦══╗╔══╦══╦══╗
     ║╬║╬║║║║║╦╣╔╩╗╔╝║╔╗╠╗╔╣══╣
     ║╔╣╗╣║╠╣║╩╣╚╗║║─║╔╗║║║╠══║
     ╚╝╚╩╩═╩═╩═╩═╝╚╝─╚══╝╚╝╚══╝"
echo "     🆁🅰🅸🅽🅱🅾🆆  🅱🆄🆃🆃🅴🆁🅵🅻🆈  🅶🅼🅰🅸🅽🅶"
echo "  ∴══• Cᴏᴘʏʀɪɢʜᴛ Rᴇsᴇʀᴠᴇᴅ Bʏ •══∴\n    ≪─━ BTS×BSC [𝟤𝟢𝟣𝟫-𝟤𝟢𝟤𝟢] ━─≫"
echo "   ---------------------------------
      🆁🅰🅸🅽🅱🅾🆆 🅱🆄🆃🆃🅴🆁🅵🅻🆈 🅶🅼🅰🅸🅽🅶
        • Dec & Remoded BY •
          『 Aʙɪʀ Vɪʀᴜs 』
   ---------------------------------"
echo "ᴏʀɪɢɪɴᴀʟ ғɪʟᴇ ᴍᴀᴅᴇ ʙʏ  @ɪᵗˢ481ʀ & @xᶜᵒᵈᵉᴀⁿⁱᵏ"
echo "    Tʜɪs Fɪʟᴇ Oɴʟʏ Fᴏʀ RBG VɪP Mᴇᴍʙᴇʀs "
echo ""
chmod -R 000 /storage/emulated/0/android/data/com.pubg.krmobile/files/UE4Game/ShadowTrackerExtra/ShadowTrackerExtra/Saved/Paks/game_patch_0.17.0.11802.pak
chmod -R 755 /data/data/com.pubg.krmobile/lib/liblbs.so
chmod -R 755 /data/data/com.pubg.krmobile/lib/libtersafe.so
chmod -R 755 /data/data/com.pubg.krmobile/lib/libtprt.so
chmod -R 755 /data/data/com.pubg.krmobile/lib/libUE4.so
echo "
     ╔═╦═╦═╗╔╦═╦═╦══╗╔══╦══╦══╗
     ║╬║╬║║║║║╦╣╔╩╗╔╝║╔╗╠╗╔╣══╣
     ║╔╣╗╣║╠╣║╩╣╚╗║║─║╔╗║║║╠══║
     ╚╝╚╩╩═╩═╩═╩═╝╚╝─╚══╝╚╝╚══╝"
echo "     🆁🅰🅸🅽🅱🅾🆆  🅱🆄🆃🆃🅴🆁🅵🅻🆈  🅶🅼🅰🅸🅽🅶"
echo "  ∴══• Cᴏᴘʏʀɪɢʜᴛ Rᴇsᴇʀᴠᴇᴅ Bʏ •══∴\n    ≪─━ BTS×BSC [𝟤𝟢𝟣𝟫-𝟤𝟢𝟤𝟢] ━─≫"
echo "   ---------------------------------
      🆁🅰🅸🅽🅱🅾🆆 🅱🆄🆃🆃🅴🆁🅵🅻🆈 🅶🅼🅰🅸🅽🅶
        • Dec & Remoded BY •
          『 Aʙɪʀ Vɪʀᴜs 』
   ---------------------------------"
echo "ᴏʀɪɢɪɴᴀʟ ғɪʟᴇ ᴍᴀᴅᴇ ʙʏ  @ɪᵗˢ481ʀ & @xᶜᵒᵈᵉᴀⁿⁱᵏ"
echo "    Tʜɪs Fɪʟᴇ Oɴʟʏ Fᴏʀ RBG VɪP Mᴇᴍʙᴇʀs "
echo ""
echo "ANTIBAN ON"
